# UnableToBindLinkInstances Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToBindLinkInstances Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to bind some link instances. Either linked file contains no 3d elements or there was an error loading its elements into the current project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToBindLinkInstances { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToBindLinkInstances As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToBindLinkInstances {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace